---
kind: method
id: M:Autodesk.Revit.DB.View.GetDependentViewIds
zh: 视图
source: html/07ba2649-c343-a59b-5bf2-00f3d8f24d10.htm
---
# Autodesk.Revit.DB.View.GetDependentViewIds Method

**中文**: 视图

Get the ids of dependent views.

## Syntax (C#)
```csharp
public ICollection<ElementId> GetDependentViewIds()
```

## Returns
Ids of the dependent views.